Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcu_stm32h7x.c
/*
        Name: mcu_stm32h7x.c
        Description: Contains all the function declarations necessary to
   interact with the MCU. This provides a opac intenterface between the µCNC and
   the MCU unit used to power the µCNC.

        Copyright: Copyright (c) João Martins
        Author: João Martins
        Date: 05-12-2024

        µCNC is free software: you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation, either version 3 of the License, or
        (at your option) any later version. Please see
   <http://www.gnu.org/licenses/>

        µCNC is distributed WITHOUT ANY WARRANTY;
        Also without the implied warranty of	MERCHANTABILITY or FITNESS FOR A
   PARTICULAR PURPOSE. See the	GNU General Public License for more details.
*/

#include "../../../cnc.h"

#if (MCU == MCU_STM32H7X)
#include "core_cm7.h"
#include "mcumap_stm32h7x.h"
#include "stm32h7xx.h"
#include "stm32h7xx_hal.h"
#include <math.h>

#ifdef MCU_HAS_USB
#ifndef USB_OTG_FS
#define USB_HIGHSPEED_MODE
#endif

#ifdef USB_HIGHSPEED_MODE
#define USB_OTG_FS USB_OTG_HS
#define OTG_FS_IRQHandler OTG_HS_IRQHandler
#define OTG_FS_IRQn OTG_HS_IRQn
#define RCC_AHB1ENR_USB2OTGFSEN RCC_AHB1ENR_USB1OTGHSEN
#define BOARD_DEVICE_RHPORT_SPEED OPT_MODE_HIGH_SPEED
#define BOARD_DEVICE_RHPORT_NUM 1
#define BOARD_DEVICE_RHPORT_SPEED OPT_MODE_HIGH_SPEED
#define CFG_TUSB_RHPORT1_MODE (OPT_MODE_DEVICE | OPT_MODE_HIGH_SPEED)
#endif

#include <tusb_ucnc.h>
#endif

// #ifndef FLASH_SIZE
// #define FLASH_SIZE (FLASH_END - FLASH_BASE + 1)
// #endif

// // this is needed if a custom flash size is defined
// #define FLASH_LIMIT (FLASH_BASE + (FLASH_SIZE) - 1)

// #if (FLASH_LIMIT > FLASH_END)
// #error "The set FLASH_SIZE is beyond the chip capability"
// #endif

// #define FLASH_EEPROM_SIZE_WORD (NVM_STORAGE_SIZE >> 2)
// #define FLASH_EEPROM_SIZE_WORD_ALIGNED (FLASH_EEPROM_SIZE_WORD << 2)

// #ifndef FLASH_SECTOR_SIZE
// #define FLASH_SECTOR_SIZE 0x20000UL
// #endif
// #define FLASH_SECTORS ((FLASH_SIZE) / FLASH_SECTOR_SIZE) + 4

// #define FLASH_EEPROM_START (FLASH_LIMIT - FLASH_SECTOR_SIZE + 1)
// #define FLASH_EEPROM_PER_SECTION (FLASH_SECTOR_SIZE /
// FLASH_EEPROM_SIZE_WORD_ALIGNED) #define FLASH_EEPROM_END (FLASH_EEPROM_START
// + (FLASH_EEPROM_PER_SECTION * FLASH_EEPROM_SIZE_WORD_ALIGNED) - 1)
// // read and write invert
// #define READ_FLASH(ram_ptr, flash_ptr) (*ram_ptr = ~(*flash_ptr))
// #define WRITE_FLASH(flash_ptr, ram_ptr) (*flash_ptr = ~(*ram_ptr))
#define EEPROM_CLEAN 0
#define EEPROM_DIRTY 1
#define EEPROM_NEEDS_NEWPAGE 2

static uint8_t stm32_eeprom_buffer[0x800];
static uint32_t stm32_flash_current_offset;
static uint8_t stm32_flash_modified;
static void FORCEINLINE mcu_eeprom_init(void);

/**
 * The internal clock counter
 * Increments every millisecond
 * Can count up to almost 50 days
 **/
static volatile uint32_t mcu_runtime_ms;

/**
 * The isr functions
 * The respective IRQHandler will execute these functions
 **/
#ifdef MCU_HAS_UART
#ifndef UART_TX_BUFFER_SIZE
#define UART_TX_BUFFER_SIZE 64
#endif
DECL_BUFFER(uint8_t, uart_tx, UART_TX_BUFFER_SIZE);
DECL_BUFFER(uint8_t, uart_rx, RX_BUFFER_SIZE);

void MCU_SERIAL_ISR(void) {
  if (COM_UART->ISR & USART_ISR_RXNE_RXFNE) {
    uint8_t c = COM_INREG;
#if !defined(DETACH_UART_FROM_MAIN_PROTOCOL)
    if (mcu_com_rx_cb(c)) {
      if (!BUFFER_TRY_ENQUEUE(uart_rx, &c)) {
        STREAM_OVF(c);
      }
    }
#else
    mcu_uart_rx_cb(c);
#endif
  }

  if ((COM_UART->ISR & USART_ISR_TXE_TXFNF) &&
      (COM_UART->CR1 & USART_CR1_TXEIE_TXFNFIE)) {
    uint8_t c;

    if (!BUFFER_TRY_DEQUEUE(uart_tx, &c)) {
      COM_UART->CR1 &= ~(USART_CR1_TXEIE_TXFNFIE);
      return;
    }

    COM_OUTREG = c;
  }
}
#endif

#ifdef MCU_HAS_UART2
#ifndef UART2_TX_BUFFER_SIZE
#define UART2_TX_BUFFER_SIZE 64
#endif
DECL_BUFFER(uint8_t, uart2_tx, UART2_TX_BUFFER_SIZE);
DECL_BUFFER(uint8_t, uart2_rx, RX_BUFFER_SIZE);

void MCU_SERIAL2_ISR(void) {
  if (COM2_UART->ISR & USART_ISR_RXNE_RXFNE) {
    uint8_t c = COM2_INREG;
#if !defined(DETACH_UART2_FROM_MAIN_PROTOCOL)
    if (mcu_com_rx_cb(c)) {
      if (!BUFFER_TRY_ENQUEUE(uart2_rx, &c)) {
        STREAM_OVF(c);
      }
    }
#else
    mcu_uart2_rx_cb(c);
#ifndef UART2_DISABLE_BUFFER
    if (!BUFFER_TRY_ENQUEUE(uart2_rx, &c)) {
      STREAM_OVF(c);
    }

#endif
#endif
  }

  if ((COM2_UART->ISR & USART_ISR_TXE_TXFNF) &&
      (COM2_UART->CR1 & USART_CR1_TXEIE_TXFNFIE)) {
    uint8_t c;

    if (!BUFFER_TRY_DEQUEUE(uart2_tx, &c)) {
      COM2_UART->CR1 &= ~(USART_CR1_TXEIE_TXFNFIE);
      return;
    }

    COM2_OUTREG = c;
  }
}
#endif

#if defined(MCU_HAS_USB) && !defined(USBD_USE_CDC)
void OTG_FS_IRQHandler(void) {
  tusb_cdc_isr_handler();
  USB_OTG_FS->GINTSTS = 0xF8F0FC0A;
}
#endif

// define the mcu internal servo variables
#if SERVOS_MASK > 0

static uint8_t mcu_servos[6];

static FORCEINLINE void mcu_clear_servos() {
#if ASSERT_PIN(SERVO0)
  io_clear_output(SERVO0);
#endif
#if ASSERT_PIN(SERVO1)
  io_clear_output(SERVO1);
#endif
#if ASSERT_PIN(SERVO2)
  io_clear_output(SERVO2);
#endif
#if ASSERT_PIN(SERVO3)
  io_clear_output(SERVO3);
#endif
#if ASSERT_PIN(SERVO4)
  io_clear_output(SERVO4);
#endif
#if ASSERT_PIN(SERVO5)
  io_clear_output(SERVO5);
#endif
}

// starts a constant rate pulse at a given frequency.
void servo_timer_init(void) {
  RCC->SERVO_TIMER_ENREG |= SERVO_TIMER_APB;
  SERVO_TIMER_REG->CR1 = 0;
  SERVO_TIMER_REG->DIER = 0;
  SERVO_TIMER_REG->PSC = (SERVO_TIMER_CLOCK / 255000) - 1;
  SERVO_TIMER_REG->ARR = 255;
  SERVO_TIMER_REG->EGR |= 0x01;
  SERVO_TIMER_REG->SR &= ~0x01;
}

void servo_start_timeout(uint8_t val) {
  SERVO_TIMER_REG->ARR = (val << 1) + 125;
  NVIC_SetPriority(MCU_SERVO_IRQ, NVIC_SERVO_IRQ_Pri);
  NVIC_ClearPendingIRQ(MCU_SERVO_IRQ);
  NVIC_EnableIRQ(MCU_SERVO_IRQ);
  SERVO_TIMER_REG->DIER |= 1;
  SERVO_TIMER_REG->CR1 |= 1; // enable timer upcounter no preload
}

void MCU_SERVO_ISR(void) {
  if ((SERVO_TIMER_REG->SR & 1)) {
    mcu_clear_servos();
    SERVO_TIMER_REG->DIER = 0;
    SERVO_TIMER_REG->SR = 0;
    SERVO_TIMER_REG->CR1 = 0;
  }
}

#endif

