Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcu_stm32h7x.c
void MCU_ITP_ISR(void) {
  static bool resetstep = false;
  if ((TIMER_REG->SR & 1)) {
    if (!resetstep) {
      mcu_step_cb();
    } else
      mcu_step_reset_cb();
    resetstep = !resetstep;
  }
  TIMER_REG->SR = 0;
}

#define LIMITS_EXTIBITMASK                                                     \
  (LIMIT_X_EXTIBITMASK | LIMIT_Y_EXTIBITMASK | LIMIT_Z_EXTIBITMASK |           \
   LIMIT_X2_EXTIBITMASK | LIMIT_Y2_EXTIBITMASK | LIMIT_Z2_EXTIBITMASK |        \
   LIMIT_A_EXTIBITMASK | LIMIT_B_EXTIBITMASK | LIMIT_C_EXTIBITMASK)
#define CONTROLS_EXTIBITMASK                                                   \
  (ESTOP_EXTIBITMASK | SAFETY_DOOR_EXTIBITMASK | FHOLD_EXTIBITMASK |           \
   CS_RES_EXTIBITMASK)
#define DIN_IO_EXTIBITMASK                                                     \
  (DIN0_EXTIBITMASK | DIN1_EXTIBITMASK | DIN2_EXTIBITMASK | DIN3_EXTIBITMASK | \
   DIN4_EXTIBITMASK | DIN5_EXTIBITMASK | DIN6_EXTIBITMASK | DIN7_EXTIBITMASK)
#define ALL_EXTIBITMASK                                                        \
  (LIMITS_EXTIBITMASK | CONTROLS_EXTIBITMASK | PROBE_EXTIBITMASK |             \
   DIN_IO_EXTIBITMASK)

#if (ALL_EXTIBITMASK != 0)
static void mcu_input_isr(void) {
#if (LIMITS_EXTIBITMASK != 0)
  if (EXTI->PR & LIMITS_EXTIBITMASK) {
    mcu_limits_changed_cb();
  }
#endif
#if (CONTROLS_EXTIBITMASK != 0)
  if (EXTI->PR & CONTROLS_EXTIBITMASK) {
    mcu_controls_changed_cb();
  }
#endif
#if (PROBE_EXTIBITMASK != 0)
  if (EXTI->PR & PROBE_EXTIBITMASK) {
    mcu_probe_changed_cb();
  }
#endif
#if (DIN_IO_EXTIBITMASK != 0)
  if (EXTI->PR & DIN_IO_EXTIBITMASK) {
    mcu_inputs_changed_cb();
  }
#endif

  EXTI->PR = ALL_EXTIBITMASK;
}

#if (ALL_EXTIBITMASK & 0x0001)
void EXTI0_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x0002)
void EXTI1_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x0004)
void EXTI2_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x0008)
void EXTI3_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x0010)
void EXTI4_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x03E0)
void EXTI9_5_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0xFC00)
void EXTI15_10_IRQHandler(void) { mcu_input_isr(); }
#endif
#endif

void PendSV_Handler(void) {
  uint32_t millis = mcu_runtime_ms;
  mcu_rtc_cb(millis);
  NVIC_ClearPendingIRQ(PendSV_IRQn);
}

#if !defined(ARDUINO_ARCH_STM32) || defined(CUSTOM_PRE_MAIN)
void SysTick_IRQHandler(void)
#else
void osSystickHandler(void)
#endif
{
#if SERVOS_MASK > 0
  static uint8_t ms_servo_counter = 0;
  uint8_t servo_counter = ms_servo_counter;

  switch (servo_counter) {
#if ASSERT_PIN(SERVO0)
  case SERVO0_FRAME:
    servo_start_timeout(mcu_servos[0]);
    io_set_output(SERVO0);
    break;
#endif
#if ASSERT_PIN(SERVO1)
  case SERVO1_FRAME:
    io_set_output(SERVO1);
    servo_start_timeout(mcu_servos[1]);
    break;
#endif
#if ASSERT_PIN(SERVO2)
  case SERVO2_FRAME:
    io_set_output(SERVO2);
    servo_start_timeout(mcu_servos[2]);
    break;
#endif
#if ASSERT_PIN(SERVO3)
  case SERVO3_FRAME:
    io_set_output(SERVO3);
    servo_start_timeout(mcu_servos[3]);
    break;
#endif
#if ASSERT_PIN(SERVO4)
  case SERVO4_FRAME:
    io_set_output(SERVO4);
    servo_start_timeout(mcu_servos[4]);
    break;
#endif
#if ASSERT_PIN(SERVO5)
  case SERVO5_FRAME:
    io_set_output(SERVO5);
    servo_start_timeout(mcu_servos[5]);
    break;
#endif
  }

  servo_counter++;
  ms_servo_counter = (servo_counter != 20) ? servo_counter : 0;

#endif
  mcu_runtime_ms++;
  SCB->ICSR = SCB_ICSR_PENDSVSET_Msk; // signal low priority task
}

/**
 *
 * Initializes the mcu:
 *   1. Configures all IO
 *   2. Configures UART/USB
 *   3. Starts internal clock (RTC)
 **/
static void mcu_rtc_init(void);
static void mcu_usart_init(void);

#ifdef CUSTOM_CLOCKS_INIT
#ifndef PLL_N
#error You need to setup PLL_N
#endif
#ifndef PLL_Q
#error You need to setup PLL_Q
#endif
#ifndef PLL_M
#error You need to setup PLL_M
#endif
#ifndef PLL_P
#error You need to setup PLL_P
#endif
#define APB1_PRESC                                                             \
  ((F_CPU > 90000000UL)                                                        \
       ? RCC_CFGR_PPRE1_DIV4                                                   \
       : ((F_CPU > 45000000UL) ? RCC_CFGR_PPRE1_DIV2 : RCC_CFGR_PPRE1_DIV1))
#define APB2_PRESC                                                             \
  ((F_CPU > 90000000UL) ? RCC_CFGR_PPRE2_DIV2 : RCC_CFGR_PPRE2_DIV1)
#endif
#ifndef FLASH_LATENCY
#if (F_CPU <= 90000000UL)
#define FLASH_LATENCY FLASH_ACR_LATENCY_2WS
#elif (F_CPU <= 120000000UL)
#define FLASH_LATENCY FLASH_ACR_LATENCY_3WS
#elif (F_CPU <= 150000000UL)
#define FLASH_LATENCY FLASH_ACR_LATENCY_4WS
#elif (F_CPU <= 1800000000UL)
#define FLASH_LATENCY FLASH_ACR_LATENCY_5WS
#else
#define FLASH_LATENCY FLASH_ACR_LATENCY_6WS
#endif
#endif

void mcu_clocks_init() {
#ifdef CUSTOM_CLOCKS_INIT
  SystemInit();
  // enable power clock
  SETFLAG(RCC->APB1ENR, RCC_APB1ENR_PWREN);
  // set voltage regulator scale 2
  SETFLAG(PWR->CR, (0x02UL << PWR_CR_VOS_Pos));

  FLASH->ACR = (FLASH_ACR_DCEN | FLASH_ACR_ICEN | FLASH_LATENCY);

  /* Enable HSE */
  SETFLAG(RCC->CR, RCC_CR_HSEON);
  CLEARFLAG(RCC->CR, RCC_CR_HSEBYP);
  /* Wait till HSE is ready */
  while (!(RCC->CR & RCC_CR_HSERDY))
    ;

  RCC->PLLCFGR = 0;

  // Main PLL clock can be configured by the following formula:
  // choose HSI or HSE as the source:
  // fVCO = source_clock * (N / M)
  // Main PLL = fVCO / P
  // PLL48CLK = fVCO / Q
  // to make it simple just set M = external crystal
  // then all others are a fixed value to simplify making
  // fVCO = 336
  // Main PLL = fVCO / P = 336/4 = 84MHz
  // PLL48CLK = fVCO / Q = 336/7 = 48MHz
  // to run at other speeds different configuration must be applied but the
  // limit for fast AHB is 180Mhz, APB is 90Mhz and slow APB is 45Mhz
  SETFLAG(RCC->PLLCFGR,
          (RCC_PLLCFGR_PLLSRC_HSE | (PLL_M << RCC_PLLCFGR_PLLM_Pos) |
           (PLL_N << RCC_PLLCFGR_PLLN_Pos) |
           (PLL_P << RCC_PLLCFGR_PLLP_Pos) /*main clock /4*/ |
           (PLL_Q << RCC_PLLCFGR_PLLQ_Pos)));
  /* Enable PLL */
  SETFLAG(RCC->CR, RCC_CR_PLLON);
  /* Wait till PLL is ready */
  while (!CHECKFLAG(RCC->CR, RCC_CR_PLLRDY))
    ;

  /* Configure the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers */
  /* HCLK = SYSCLK, PCLK2 = HCLK, PCLK1 = HCLK / 2
   * If crystal is 16MHz, add in PLLXTPRE flag to prescale by 2
   */
  SETFLAG(RCC->CFGR, (uint32_t)(RCC_CFGR_HPRE_DIV1 | APB2_PRESC | APB1_PRESC));

  /* Select PLL as system clock source */
  CLEARFLAG(RCC->CFGR, RCC_CFGR_SW);
  SETFLAG(RCC->CFGR, (0x02UL << RCC_CFGR_SW_Pos));
  /* Wait till PLL is used as system clock source */
  while ((RCC->CFGR & RCC_CFGR_SW) != (0x02UL << RCC_CFGR_SW_Pos))
    ;
#endif
  SystemCoreClockUpdate();
  // initialize debugger clock (used by us delay)
  if (!(CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk)) {
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
  }
}

void mcu_usb_init(void) {
#if defined(MCU_HAS_USB)
  __HAL_RCC_GPIOA_CLK_ENABLE();
  // configure USB as Virtual COM port
  mcu_config_input(USB_DM);
  mcu_config_input(USB_DP);
  mcu_config_af(USB_DP, GPIO_OTG_AF);
  mcu_config_af(USB_DM, GPIO_OTG_AF);
  RCC->AHB1ENR |= RCC_AHB1ENR_USB2OTGFSEN;

  // enable usb vreg
  PWR->CR3 |= PWR_CR3_USBREGEN;
  while (!CHECKFLAG(PWR->CR3, PWR_FLAG_USB33RDY))
    ;
  PWR->CR3 |= PWR_CR3_USB33DEN;

  // /* Disable all interrupts. */
  USB_OTG_FS->GINTMSK = 0U;

  // /* Operate as device only mode */
  USB_OTG_FS->GUSBCFG &= ~USB_OTG_GUSBCFG_FHMOD;
  USB_OTG_FS->GUSBCFG |= (USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL);

  // /* Clear any pending interrupts */
  USB_OTG_FS->GINTSTS = 0xF8F0FC0A;
  USB_OTG_FS->GINTMSK |= USB_OTG_GINTMSK_OTGINT;

