Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcu_stm32h7x.c
  USB_OTG_FS->GCCFG |= USB_OTG_GCCFG_PWRDWN;
  USB_OTG_FS->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN;
  USB_OTG_FS->GOTGCTL |= USB_OTG_GOTGCTL_BVALOVAL;

  NVIC_SetPriority(OTG_FS_IRQn, NVIC_USB_IRQ_Pri);
  NVIC_ClearPendingIRQ(OTG_FS_IRQn);
  NVIC_EnableIRQ(OTG_FS_IRQn);

  tusb_cdc_init();
#endif
}

void mcu_uart_init(void) {
#ifdef MCU_HAS_UART
  /*enables RCC clocks and GPIO*/
  RCC->D2CCIP2R &= ~0x3F;
  RCC->COM_APB |= (COM_APBEN);
  mcu_config_af(TX, GPIO_AF_USART);
  mcu_config_af(RX, GPIO_AF_USART);
  /*setup UART*/
  COM_UART->CR1 = 0; // 8 bits No parity M=0 PCE=0
  COM_UART->CR2 = 0; // 1 stop bit STOP=00
  COM_UART->CR3 = 0;
  COM_UART->ISR = 0;
  // //115200 baudrate
  float baudrate = ((float)(UART_CLOCK) / ((float)(BAUDRATE)));
  uint16_t brr = (uint16_t)baudrate;
  COM_UART->BRR = brr;
  COM_UART->CR1 |= USART_CR1_RXNEIE_RXFNEIE; // enable RXNEIE
  NVIC_SetPriority(COM_IRQ, NVIC_UART_IRQ_Pri);
  NVIC_ClearPendingIRQ(COM_IRQ);
  NVIC_EnableIRQ(COM_IRQ);
  COM_UART->CR1 |=
      (USART_CR1_RE | USART_CR1_TE | USART_CR1_UE); // enable TE, RE and UART
#endif
}

void mcu_uart2_init(void) {
#ifdef MCU_HAS_UART2
  /*enables RCC clocks and GPIO*/
  RCC->D2CCIP2R &= ~0x3F;
  RCC->COM2_APB |= (COM2_APBEN);
  mcu_config_af(TX2, GPIO_AF_USART2);
  mcu_config_af(RX2, GPIO_AF_USART2);
  /*setup UART*/
  COM2_UART->CR1 = 0; // 8 bits No parity M=0 PCE=0
  COM2_UART->CR2 = 0; // 1 stop bit STOP=00
  COM2_UART->CR3 = 0;
  COM2_UART->ISR = 0;
  // //115200 baudrate
  float baudrate2 = ((float)(UART2_CLOCK) / ((float)(BAUDRATE2)));
  uint16_t brr2 = (uint16_t)baudrate2;
  COM2_UART->BRR = brr2;
  COM2_UART->CR1 |= USART_CR1_RXNEIE_RXFNEIE; // enable RXNEIE
  NVIC_SetPriority(COM2_IRQ, NVIC_UART_IRQ_Pri);
  NVIC_ClearPendingIRQ(COM2_IRQ);
  NVIC_EnableIRQ(COM2_IRQ);
  COM2_UART->CR1 |=
      (USART_CR1_RE | USART_CR1_TE | USART_CR1_UE); // enable TE, RE and UART
#endif
}

#ifdef MCU_HAS_USB
DECL_BUFFER(uint8_t, usb_rx, RX_BUFFER_SIZE);

uint8_t mcu_usb_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(usb_rx, &c);
  return c;
}

uint8_t mcu_usb_available(void) { return BUFFER_READ_AVAILABLE(usb_rx); }

void mcu_usb_clear(void) { BUFFER_CLEAR(usb_rx); }

void mcu_usb_putc(uint8_t c) {
  if (!tusb_cdc_write_available()) {
    mcu_usb_flush();
  }
  tusb_cdc_write(c);
}

void mcu_usb_flush(void) {
  tusb_cdc_flush();
  while (!tusb_cdc_write_available()) {
    mcu_dotasks(); // tinyusb device task
    if (!tusb_cdc_connected) {
      return;
    }
  }
}
#endif

#ifdef MCU_HAS_UART
uint8_t mcu_uart_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(uart_rx, &c);
  return c;
}

uint8_t mcu_uart_available(void) { return BUFFER_READ_AVAILABLE(uart_rx); }

void mcu_uart_clear(void) { BUFFER_CLEAR(uart_rx); }

void mcu_uart_putc(uint8_t c) {
  while (!BUFFER_TRY_ENQUEUE(uart_tx, &c)) {
    mcu_uart_flush();
  }
}

void mcu_uart_flush(void) {

  if (!(COM_UART->CR1 & USART_CR1_TXEIE)) // not ready start flushing
  {
    COM_UART->CR1 |= (USART_CR1_TXEIE);
#if ASSERT_PIN(ACTIVITY_LED)
    io_toggle_output(ACTIVITY_LED);
#endif
  }
}

#endif

#ifdef MCU_HAS_UART2
uint8_t mcu_uart2_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(uart2_rx, &c);
  return c;
}

uint8_t mcu_uart2_available(void) { return BUFFER_READ_AVAILABLE(uart2_rx); }

void mcu_uart2_clear(void) { BUFFER_CLEAR(uart2_rx); }

void mcu_uart2_putc(uint8_t c) {
  while (!BUFFER_TRY_ENQUEUE(uart2_tx, &c)) {
    mcu_uart2_flush();
  }
}

void mcu_uart2_flush(void) {
  if (!(COM2_UART->CR1 & USART_CR1_TXEIE)) // not ready start flushing
  {
    COM2_UART->CR1 |= (USART_CR1_TXEIE);
#if ASSERT_PIN(ACTIVITY_LED)
    io_toggle_output(ACTIVITY_LED);
#endif
  }
}

#endif

void mcu_i2c_init() {
#ifdef MCU_HAS_I2C
  // set max freq
  mcu_i2c_config(I2C_FREQ);
#endif
}

void mcu_init(void) {
  // make sure both APB1 and APB2 are running at the same clock (48MHz)
  mcu_clocks_init();
  mcu_io_init();
  mcu_rtc_init();
#if SERVOS_MASK > 0
  servo_timer_init();
#endif

  stm32_flash_current_offset = 0;
  mcu_disable_global_isr();
  mcu_eeprom_init();
  mcu_enable_global_isr();
}

/*IO functions*/
// IO functions
void mcu_set_servo(uint8_t servo, uint8_t value) {
#if SERVOS_MASK > 0
  mcu_servos[servo - SERVO_PINS_OFFSET] = value;
#endif
}

/**
 * gets the pwm for a servo (50Hz with tON between 1~2ms)
 * can be defined either as a function or a macro call
 * */
uint8_t mcu_get_servo(uint8_t servo) {
#if SERVOS_MASK > 0
  uint8_t offset = servo - SERVO_PINS_OFFSET;

  if ((1U << offset) & SERVOS_MASK) {
    return mcu_servos[offset];
  }
#endif
  return 0;
}

// ISR
// enables all interrupts on the mcu. Must be called to enable all IRS functions
#ifndef mcu_enable_global_isr
#error "mcu_enable_global_isr undefined"
#endif
// disables all ISR functions
#ifndef mcu_disable_global_isr
#error "mcu_disable_global_isr undefined"
#endif

// Timers
// convert step rate to clock cycles
void mcu_freq_to_clocks(float frequency, uint16_t *ticks,
                        uint16_t *prescaller) {
  frequency = CLAMP((float)F_STEP_MIN, frequency, (float)F_STEP_MAX);

  // up and down counter (generates half the step rate at each event)
  uint32_t totalticks = (uint32_t)((float)(TIMER_CLOCK) / frequency);
  *prescaller = 1;
  while (totalticks > 0xFFFF) {
    *prescaller <<= 1;
    totalticks >>= 1;
  }

  (*prescaller) -= 1;
  *ticks = (uint16_t)totalticks;
}

float mcu_clocks_to_freq(uint16_t ticks, uint16_t prescaller) {
  return ((float)TIMER_CLOCK / (float)(((uint32_t)ticks) << (prescaller)));
}

// starts a constant rate pulse at a given frequency.
void mcu_start_itp_isr(uint16_t ticks, uint16_t prescaller) {
  RCC->TIMER_ENREG |= TIMER_APB;
  TIMER_REG->CR1 = 0;
  TIMER_REG->DIER = 0;
  TIMER_REG->PSC = prescaller;
  TIMER_REG->ARR = ticks;
  TIMER_REG->EGR |= 0x01;
  TIMER_REG->SR &= ~0x01;

  NVIC_SetPriority(MCU_ITP_IRQ, NVIC_ITP_IRQ_Pri);
  NVIC_ClearPendingIRQ(MCU_ITP_IRQ);
  NVIC_EnableIRQ(MCU_ITP_IRQ);

  TIMER_REG->DIER |= 1;
  TIMER_REG->CR1 |= 1; // enable timer upcounter no preload
}

// modifies the pulse frequency
void mcu_change_itp_isr(uint16_t ticks, uint16_t prescaller) {
  TIMER_REG->ARR = ticks;
  TIMER_REG->PSC = prescaller;
  TIMER_REG->EGR |= 0x01;
}

// stops the pulse
void mcu_stop_itp_isr(void) {
  TIMER_REG->CR1 &= ~0x1;
  TIMER_REG->DIER &= ~0x1;
  TIMER_REG->SR &= ~0x01;
  NVIC_DisableIRQ(MCU_ITP_IRQ);
}

