Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcu_stm32h7x.c
// Custom delay function
// gets the mcu running time in ms
uint32_t mcu_millis() { return mcu_runtime_ms; }

uint32_t mcu_micros() { return ((mcu_runtime_ms * 1000) + mcu_free_micros()); }

void mcu_rtc_init() {
  SysTick->CTRL = 0;
  SysTick->LOAD = ((F_CPU / 1000) - 1);
  SysTick->VAL = 0;
  NVIC_SetPriority(SysTick_IRQn, NVIC_RTC_IRQ_Pri);
  SysTick->CTRL = 7;                   // Start SysTick (ABH clock)
  NVIC_SetPriority(PendSV_IRQn, 0xFF); // background task
}

void mcu_dotasks() {
#ifdef MCU_HAS_USB
  tusb_cdc_task(); // tinyusb device task

  while (tusb_cdc_available()) {
    uint8_t c = (uint8_t)tusb_cdc_read();
#if !defined(DETACH_USB_FROM_MAIN_PROTOCOL)
    if (mcu_com_rx_cb(c)) {
      if (!BUFFER_TRY_ENQUEUE(usb_rx, &c)) {
        STREAM_OVF(c);
      }
    }
#else
    mcu_usb_rx_cb(c);
#endif
  }
#endif
}

// gets were the first copy of the eeprom is
static void mcu_eeprom_init(void) {
  // uint32_t eeprom_offset = 0;
  // for (eeprom_offset = 0; eeprom_offset < FLASH_SECTOR_SIZE; eeprom_offset +=
  // FLASH_EEPROM_SIZE_WORD_ALIGNED)
  // {
  // 	if (*((volatile uint32_t *)(FLASH_EEPROM_START + eeprom_offset)) ==
  // 0xFFFFFFFF)
  // 	{
  // 		break;
  // 	}
  // }

  // // if not found at start then it's not initialized
  // if (eeprom_offset)
  // {
  // 	// one step back
  // 	eeprom_offset -= FLASH_EEPROM_SIZE_WORD_ALIGNED;
  // 	stm32_flash_current_offset = eeprom_offset;
  // }
  // else
  // {
  // 	stm32_flash_current_offset = 0;
  // 	stm32_flash_modified = EEPROM_CLEAN;
  // 	memset(stm32_eeprom_buffer, 0, FLASH_EEPROM_SIZE_WORD_ALIGNED);
  // 	return;
  // }

  // uint32_t counter = (uint32_t)FLASH_EEPROM_SIZE_WORD;
  // uint32_t *ptr = ((uint32_t *)&stm32_eeprom_buffer[0]);
  // volatile uint32_t *eeprom = ((volatile uint32_t *)(FLASH_EEPROM_START +
  // eeprom_offset)); while (counter--)
  // {
  // 	READ_FLASH(ptr, eeprom);
  // 	eeprom++;
  // 	ptr++;
  // }
}

// Non volatile memory
uint8_t mcu_eeprom_getc(uint16_t address) {
  // if (NVM_STORAGE_SIZE <= address)
  // {
  // 	DBGMSG("EEPROM invalid address @ %u",address);
  // 	return 0;
  // }
  // return stm32_eeprom_buffer[address];
  return 0;
}

static void mcu_eeprom_erase(void) {
  // while (FLASH->SR & FLASH_SR_BSY)
  // 	; // wait while busy
  // // unlock flash if locked
  // if (FLASH->CR & FLASH_CR_LOCK)
  // {
  // 	FLASH->KEYR = 0x45670123;
  // 	FLASH->KEYR = 0xCDEF89AB;
  // }
  // FLASH->CR = 0;
  // // Ensure PG bit is low FLASH->CR |= FLASH_CR_SER | (((FLASH_SECTORS - 1)
  // << FLASH_CR_SNB_Pos) & FLASH_CR_MER_Msk); // set the SER bit FLASH->CR |=
  // FLASH_CR_STRT;
  // // set the start bit while (FLASH->SR & FLASH_SR_BSY) 	; // wait while busy
  // FLASH->CR = 0;
}

void mcu_eeprom_putc(uint16_t address, uint8_t value) {
  // if (NVM_STORAGE_SIZE <= address)
  // {
  // 	DBGMSG("EEPROM invalid address @ %u",address);
  // }
  // // if the value of the eeprom is modified then it will be marked as dirty
  // // flash default value is 0xFF. If programming can change value from 1 to 0
  // but not the other way around
  // // if a bit is changed from 0 back to 1 then it will need to rewrite values
  // in a new page
  // // flash read and writing is done in negated form
  // if (stm32_eeprom_buffer[address] != value)
  // {
  // 	stm32_flash_modified |= EEPROM_DIRTY;
  // 	if ((value ^ stm32_eeprom_buffer[address]) & ~value)
  // 	{
  // 		stm32_flash_modified |= EEPROM_NEEDS_NEWPAGE;
  // 	}
  // }

  // stm32_eeprom_buffer[address] = value;
}

void mcu_eeprom_flush() {
  // if (stm32_flash_modified)
  // {
  // 	if (CHECKFLAG(stm32_flash_modified, EEPROM_NEEDS_NEWPAGE))
  // 	{
  // 		stm32_flash_current_offset += FLASH_EEPROM_SIZE_WORD_ALIGNED;
  // 	}

  // 	if (stm32_flash_current_offset >= FLASH_EEPROM_END)
  // 	{
  // 		mcu_eeprom_erase();
  // 		stm32_flash_current_offset = 0;
  // 	}

  // 	volatile uint32_t *eeprom = ((volatile uint32_t *)(FLASH_EEPROM_START +
  // stm32_flash_current_offset)); 	uint32_t *ptr = ((uint32_t
  // *)&stm32_eeprom_buffer[0]); 	uint32_t counter =
  // (uint32_t)FLASH_EEPROM_SIZE_WORD; 	while (counter--)
  // 	{
  // 		while (FLASH->SR & FLASH_SR_BSY)
  // 			; // wait while busy
  // 		mcu_disable_global_isr();
  // 		// unlock flash if locked
  // 		if (FLASH->CR & FLASH_CR_LOCK)
  // 		{
  // 			FLASH->KEYR = 0x45670123;
  // 			FLASH->KEYR = 0xCDEF89AB;
  // 		}
  // 		FLASH->CR = 0;
  // 		FLASH->CR |= FLASH_CR_PSIZE_1;
  // 		FLASH->CR |= FLASH_CR_PG; // Ensure PG bit is high
  // 		WRITE_FLASH(eeprom, ptr);
  // 		while (FLASH->SR & FLASH_SR_BSY)
  // 			; // wait while busy
  // 		mcu_enable_global_isr();
  // 		if (FLASH->SR & (FLASH_SR_PGAERR | FLASH_SR_PGPERR |
  // FLASH_SR_PGSERR)) 			proto_error(42); // STATUS_SETTING_WRITE_FAIL 		if
  // (FLASH->SR & FLASH_SR_WRPERR) 			proto_error(43); //
  // STATUS_SETTING_PROTECTED_FAIL 		FLASH->CR = 0;
  // // Ensure PG bit is low 		FLASH->SR = 0; 		eeprom++; 		ptr++;
  // 	}
  // 	stm32_flash_modified = EEPROM_CLEAN;

  // 	// Restore interrupt flag state.*/
  // }
}

typedef enum spi_port_state_enum {
  SPI_UNKNOWN = 0,
  SPI_IDLE = 1,
  SPI_TRANSMITTING = 2,
  SPI_TRANSMIT_COMPLETE = 3,
} spi_port_state_t;

#ifdef MCU_HAS_SPI
#ifndef USE_ARDUINO_SPI_LIBRARY
static volatile spi_port_state_t spi_port_state = SPI_UNKNOWN;
static bool spi_enable_dma = false;

void mcu_spi_init(void) {
#ifdef MCU_HAS_SPI
  spi_config_t spi_conf = {0};
  spi_conf.mode = SPI_MODE;
  mcu_spi_config(spi_conf, SPI_FREQ);
#endif
}

void mcu_spi_config(spi_config_t config, uint32_t frequency) {
  uint8_t div = (frequency >= 2000000UL)
                    ? (uint8_t)(SPI_CLOCK / frequency)
                    : (uint8_t)(SPI_CLOCK_SLOW / frequency);

  uint8_t speed;
  if (div <= 2) {
    speed = 0;
  } else if (div <= 4) {
    speed = 1;
  } else if (div <= 8) {
    speed = 2;
  } else if (div <= 16) {
    speed = 3;
  } else if (div <= 32) {
    speed = 4;
  } else if (div <= 64) {
    speed = 5;
  } else if (div <= 128) {
    speed = 6;
  } else {
    speed = 7;
  }

  // disable SPI
  SPI_REG->CR1 &= ~SPI_CR1_SPE;

  // config RCC
  SPI_ENREG &= ~SPI_ENVAL;
  /**
   * switch peripheral clock source depending on the required frequency
   */
  if ((frequency >= 2000000UL)) {
    __HAL_RCC_CLKP_CONFIG(RCC_CLKPSOURCE_HSI);
  } else {
    __HAL_RCC_CLKP_CONFIG(RCC_CLKPSOURCE_CSI);
  }
  SPI_CLOCK_SOURCE_CFG(SPI_CLOCK_SOURCE);
  SPI_ENREG |= SPI_ENVAL;
  mcu_config_af(SPI_SDI, SPI_SDI_AFIO);
  mcu_config_af(SPI_CLK, SPI_CLK_AFIO);
  mcu_config_af(SPI_SDO, SPI_SDO_AFIO);

  while (SPI_REG->CR1 & SPI_CR1_SPE)
    ;
  SPI_REG->CR1 |= SPI_CR1_SSI;
  SPI_REG->CR2 = 0;
  SPI_REG->CRCPOLY = 0;
  SPI_REG->I2SCFGR = 0;
  SPI_REG->IFCR = 0xFFFFFFFFUL;
  SPI_REG->IER = 0;
  // clear speed and mode
  SPI_REG->CFG2 = SPI_CFG2_SSM | SPI_CFG2_SSOE /*| SPI_CFG2_SP_0*/ |
                  SPI_CFG2_MASTER |
                  (((uint32_t)(config.mode & 0x3)) << SPI_CFG2_CPHA_Pos);
  SPI_REG->CFG1 &= ~(SPI_CFG1_DSIZE | SPI_CFG1_MBR | SPI_CFG1_FTHLV);
  SPI_REG->CFG1 |= (SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0) |
                   (((uint32_t)speed) << SPI_CFG1_MBR_Pos);
  SPI_REG->CR1 |= SPI_CR1_SPE;
  while (!(SPI_REG->CR1 & SPI_CR1_SPE))
    ;

