Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcu_stm32h7x.c
  NVIC_SetPriority(SPI_IRQ, NVIC_SPI_IRQ_Pri);
  NVIC_ClearPendingIRQ(SPI_IRQ);
  NVIC_EnableIRQ(SPI_IRQ);

  spi_port_state = SPI_IDLE;
  spi_enable_dma = config.enable_dma;
}

uint8_t mcu_spi_xmit(uint8_t c) {
  SPI_REG->CR1 |= SPI_CR1_CSTART;
  while (!(SPI_REG->SR & SPI_SR_TXP))
    ;
  *((__IO uint8_t *)&SPI_REG->TXDR) = c;
  while (!(SPI_REG->SR & SPI_SR_RXP))
    ;
  uint8_t data = *((__IO uint8_t *)&SPI_REG->RXDR);
  SPI_REG->CR1 &= ~SPI_CR1_CSTART;
  spi_port_state = SPI_IDLE;
  return data;
}

// static const uint8_t *spi_transfer_tx_ptr = 0;
// static uint8_t *spi_transfer_rx_ptr = 0;
// static uint16_t spi_transfer_tx_len = 0;
// static uint16_t spi_transfer_rx_len = 0;

// void SPI_ISR()
// {
// 	while ((SPI_REG->SR & SPI_SR_RXP) && spi_transfer_rx_len)
// 	{
// 		*spi_transfer_rx_ptr++ = *((__IO uint8_t *)&SPI_REG->RXDR);
// 		--spi_transfer_rx_len;
// 	}
// 	while ((SPI_REG->SR & SPI_SR_TXP) && spi_transfer_tx_len)
// 	{
// 		*((__IO uint8_t *)&SPI_REG->TXDR) = *spi_transfer_tx_ptr++;
// 		--spi_transfer_tx_len;
// 	}
// 	if (spi_transfer_tx_len == 0 && spi_transfer_rx_len == 0 && (SPI_REG->SR
// & SPI_SR_EOT))
// 	{
// 		SPI_REG->IER &= ~(SPI_IER_EOTIE | SPI_IER_TXPIE |
// SPI_IER_RXPIE); 		spi_port_state = SPI_TRANSMIT_COMPLETE;
// 	}
// 	NVIC_ClearPendingIRQ(SPI_IRQ);
// }

/*
 * Performs a bulk SPI transfer
 * Returns:
 *	true - transfer in progress, keep polling
 *	false - transfer complete
 */
// bool mcu_spi_bulk_transfer(const uint8_t *tx_data, uint8_t *rx_data, uint16_t
// datalen)
// {
// 	// if (!spi_enable_dma)
// 	{
// 		// Bulk transfer without DMA (uses ISR)
// 		if (spi_port_state == SPI_IDLE)
// 		{
// 			spi_port_state = SPI_TRANSMITTING;

// 			spi_transfer_tx_ptr = tx_data;
// 			spi_transfer_tx_len = datalen;

// 			if (rx_data)
// 			{
// 				spi_transfer_rx_ptr = rx_data;
// 				spi_transfer_rx_len = datalen;
// 				SPI_REG->IER |= SPI_IER_RXPIE;
// 			}
// 			else
// 			{
// 				spi_transfer_rx_ptr = 0;
// 				spi_transfer_rx_len = 0;
// 			}

// 			SPI_REG->IER = (SPI_IER_EOTIE | SPI_IER_TXPIE |
// SPI_IER_RXPIE); 			SPI_REG->CR2 &= ~SPI_CR2_TSIZE; 			SPI_REG->CR2 |=
// (datalen<<SPI_CR2_TSIZE_Pos); 			SPI_REG->IFCR = 0xFFFFFFFFUL; 			SPI_REG->CR1 |=
// SPI_CR1_CSTART;
// 		}
// 		else if (spi_port_state == SPI_TRANSMIT_COMPLETE)
// 		{
// 			SPI_REG->CR1 &= ~SPI_CR1_CSTART;
// 			spi_port_state = SPI_IDLE;
// 			return false;
// 		}

// 		return true;
// 	}

// 	// Using DMA
// 	// if (spi_port_state == SPI_TRANSMITTING)
// 	// {
// 	// 	// Wait for transfers to complete
// 	// 	if (!(SPI_DMA_TX_ISR >> (SPI_DMA_TX_IFR_POS + 5)) ||
// 	// 			(!(SPI_DMA_RX_ISR >> (SPI_DMA_RX_IFR_POS + 5))
// && rx_data))
// 	// 		return true;

// 	// 	// SPI hardware still transmitting the last byte
// 	// 	if (SPI_REG->SR & SPI_SR_BSY)
// 	// 		return true;

// 	// 	// Disable DMA use
// 	// 	SPI_REG->CR2 &= ~SPI_CR2_TXDMAEN;
// 	// 	if (rx_data)
// 	// 		SPI_REG->CR2 &= ~SPI_CR2_RXDMAEN;

// 	// 	// Transfer finished
// 	// 	spi_port_state = SPI_IDLE;
// 	// 	return false;
// 	// }

// 	// if (spi_port_state != SPI_IDLE)
// 	// {
// 	// 	// Wait for idle
// 	// 	if (SPI_REG->SR & SPI_SR_BSY)
// 	// 		return true;
// 	// 	spi_port_state = SPI_IDLE;
// 	// }

// 	// // Wait until streams are available
// 	// if ((SPI_DMA_TX_STREAM->CR & DMA_SxCR_EN) || ((SPI_DMA_RX_STREAM->CR
// & DMA_SxCR_EN) && rx_data))
// 	// 	return true;

// 	// /***     Setup Transmit DMA     ***/

// 	// // Clear flags
// 	// SPI_DMA_TX_IFCR |= SPI_DMA_TX_IFCR_MASK;

// 	// SPI_DMA_TX_STREAM->CR =
// 	// 		(SPI_DMA_TX_CHANNEL << DMA_SxCR_CHSEL_Pos) | // Select
// correct channel
// 	// 		(0b01 << DMA_SxCR_PL_Pos) |
// // Set priority to medium
// 	// 		DMA_SxCR_MINC |
// // Increment memory
// 	// 		(0b01 << DMA_SxCR_DIR_Pos);
// // Memory to peripheral transfer direction

// 	// SPI_DMA_TX_STREAM->PAR = (uint32_t)&SPI_REG->DR;
// 	// SPI_DMA_TX_STREAM->M0AR = (uint32_t)tx_data;

// 	// SPI_DMA_TX_STREAM->NDTR = datalen;

// 	// SPI_DMA_TX_STREAM->FCR &= ~DMA_SxFCR_DMDIS; // Enable direct mode

// 	// // Enable DMA use for transmission
// 	// SPI_REG->CR2 |= SPI_CR2_TXDMAEN;

// 	// if (rx_data)
// 	// {
// 	// 	/***     Setup Receive DMA     ***/

// 	// 	// Clear flags
// 	// 	SPI_DMA_RX_IFCR |= SPI_DMA_RX_IFCR_MASK;

// 	// 	SPI_DMA_RX_STREAM->CR =
// 	// 			(SPI_DMA_RX_CHANNEL << DMA_SxCR_CHSEL_Pos) | //
// Select correct channel
// 	// 			(0b01 << DMA_SxCR_PL_Pos) |
// // Set priority to medium
// 	// 			DMA_SxCR_MINC |
// // Increment memory
// 	// 			(0b00 << DMA_SxCR_DIR_Pos);
// // Peripheral to memory transfer direction

// 	// 	SPI_DMA_RX_STREAM->PAR = (uint32_t)&SPI_REG->DR;
// 	// 	SPI_DMA_RX_STREAM->M0AR = (uint32_t)rx_data;

// 	// 	SPI_DMA_RX_STREAM->NDTR = datalen;

// 	// 	SPI_DMA_RX_STREAM->FCR &= ~DMA_SxFCR_DMDIS; // Enable direct
// mode

// 	// 	// Enable DMA use for reception
// 	// 	SPI_REG->CR2 |= SPI_CR2_RXDMAEN;
// 	// }

// 	// /***     DMA Setup Complete     ***/

// 	// // Start streams
// 	// SPI_DMA_TX_STREAM->CR |= DMA_SxCR_EN;
// 	// if (rx_data)
// 	// 	SPI_DMA_RX_STREAM->CR |= DMA_SxCR_EN;

// 	// // Transmission started
// 	// spi_port_state = SPI_TRANSMITTING;
// 	return true;
// }

#endif
#endif

#ifdef MCU_HAS_SPI2
static volatile spi_port_state_t spi2_port_state = SPI_UNKNOWN;
static bool spi2_enable_dma = false;

void mcu_spi2_init(void) {
#ifdef MCU_HAS_SPI2
  spi_config_t spi2_conf = {0};
  spi2_conf.mode = SPI2_MODE;
  mcu_spi2_config(spi2_conf, SPI2_FREQ);
#endif
}

void mcu_spi2_config(spi_config_t config, uint32_t frequency) {
  uint8_t div = (frequency >= 2000000UL)
                    ? (uint8_t)(SPI2_CLOCK / frequency)
                    : (uint8_t)(SPI2_CLOCK_SLOW / frequency);

  uint8_t speed;
  if (div <= 2) {
    speed = 0;
  } else if (div <= 4) {
    speed = 1;
  } else if (div <= 8) {
    speed = 2;
  } else if (div <= 16) {
    speed = 3;
  } else if (div <= 32) {
    speed = 4;
  } else if (div <= 64) {
    speed = 5;
  } else if (div <= 128) {
    speed = 6;
  } else {
    speed = 7;
  }

  // disable SPI2
  SPI2_REG->CR1 &= ~SPI2_CR1_SPE;

  // config RCC
  SPI2_ENREG &= ~SPI2_ENVAL;
  /**
   * switch peripheral clock source depending on the required frequency
   */
  if ((frequency >= 2000000UL)) {
    __HAL_RCC_CLKP_CONFIG(RCC_CLKPSOURCE_HSI);
  } else {
    __HAL_RCC_CLKP_CONFIG(RCC_CLKPSOURCE_CSI);
  }
  SPI2_CLOCK_SOURCE_CFG(SPI2_CLOCK_SOURCE);
  SPI2_ENREG |= SPI2_ENVAL;
  mcu_config_af(SPI2_SDI, SPI2_SDI_AFIO);
  mcu_config_af(SPI2_CLK, SPI2_CLK_AFIO);
  mcu_config_af(SPI2_SDO, SPI2_SDO_AFIO);

  while (SPI2_REG->CR1 & SPI2_CR1_SPE)
    ;
  SPI2_REG->CR1 |= SPI2_CR1_SSI;
  SPI2_REG->CR2 = 0;
  SPI2_REG->CRCPOLY = 0;
  SPI2_REG->I2SCFGR = 0;
  SPI2_REG->IFCR = 0xFFFFFFFFUL;
  SPI2_REG->IER = 0;
  // clear speed and mode
  SPI2_REG->CFG2 = SPI2_CFG2_SSM | SPI2_CFG2_SSOE /*| SPI2_CFG2_SP_0*/ |
                   SPI2_CFG2_MASTER |
                   (((uint32_t)(config.mode & 0x3)) << SPI2_CFG2_CPHA_Pos);
  SPI2_REG->CFG1 &= ~(SPI2_CFG1_DSIZE | SPI2_CFG1_MBR | SPI2_CFG1_FTHLV);
  SPI2_REG->CFG1 |=
      (SPI2_CFG1_DSIZE_2 | SPI2_CFG1_DSIZE_1 | SPI2_CFG1_DSIZE_0) |
      (((uint32_t)speed) << SPI2_CFG1_MBR_Pos);
  SPI2_REG->CR1 |= SPI2_CR1_SPE;
  while (!(SPI2_REG->CR1 & SPI2_CR1_SPE))
    ;

